; domain
; no need to make preconditions match in simulation, since those can be specified in this pddl file only

(define (domain robo-home)
    (:requirements :strips :typing :existential-preconditions :negative-preconditions :conditional-effects)

    (:types

        Robot
        Cabinet Drawer CounterTop StoveBurner Shelf Sink Fridge Toaster CoffeeMachine Faucet Microwave - location
        Knife Bottle DishSponge Egg Mug Bread Potato - item
        Drawer Cabinet Fridge Microwave - openable
        Toaster CoffeeMachine - container
        Cabinet Drawer CounterTop StoveBurner Shelf Sink - receptacle
        Toaster CoffeeMachine Faucet StoveBurner Microwave - toggleable
        Egg Mug - crackable
        Mug - dirtyable
        Bread Potato - sliceable
        Mug - pourable

    )
    (:predicates
        ; tracking cookable separately since there are prerequisites for egg and bread
        (is-cookable ?i - item)
        (at-location ?r - robot ?l - location)
        (item-on ?i - item ?r - receptacle)
        (item-in ?i - item ?l - location)
        (is-open ?o - openable)
        (is-sliced ?s - sliceable)
        (is-cooked ?i - item)
        (is-full ?p - pourable)
        (is-cracked ?c - crackable)
        (is-clean ?d - dirtyable)
        (is-on ?t - toggleable)
        (is-occupied ?c - container) ; not used now
        (omelet-made ?r - robot)
        (coffee-made ?c - CoffeeMachine)
        (breakfast ?r)
    )

    (:action move
        :parameters (?r - robot ?to - location)
        :precondition (not (at-location ?r ?to))
        :effect (and (forall
                (?l - location)
                (not (at-location ?r ?l))
            )
            (at-location ?r ?to)
        )
    )

    (:action open-openable
        :parameters (?r - robot ?o - openable)
        :precondition (and (not (is-open ?o))
            (at-location ?r ?o)
        )
        :effect (is-open ?o)
    )

    (:action pick-n-place-in-openable
        :parameters (?r - robot ?i - item ?o - openable)
        :precondition (and
            (forall
                (?j - openable)
                (not (and (not (is-open ?j)) (item-in ?i ?j)))
            )
            (is-open ?o)
        )
        :effect (and
            (forall
                (?l - openable)
                (and
                    (not (item-in ?i ?l))
                    (not (at-location ?r ?l))
                )
            )
            (forall
                (?re - receptacle)
                (and
                    (not (item-on ?i ?re))
                )
            )
            (item-in ?i ?o)
            (at-location ?r ?o)
        )
    )

    (:action pick-n-place-on-receptacle
        :parameters (?r - robot ?i - item ?re - receptacle)
        :precondition (and
            (forall
                (?j - openable)
                (not (and (not (is-open ?j)) (item-in ?i ?j)))
            )
            (not (item-on ?i ?re))
        )
        :effect (and
            (forall
                (?l - location)
                (and
                    (not (at-location ?r ?l))
                )
            )
            (forall
                (?l - location)
                (and
                    (not (item-in ?i ?l))
                )
            )
            (forall
                (?rec - receptacle)
                (and
                    (not (item-on ?i ?rec))
                )
            )
            (item-on ?i ?re)
            (at-location ?r ?re)
        )
    )

    (:action pick-n-place-in-container
        :parameters (?r - robot ?i - item ?c - container)
        :precondition (and
            (forall
                (?j - openable)
                (not (and (not (is-open ?j)) (item-in ?i ?j)))
            )
            (not (item-in ?i ?c))
            (not (is-occupied ?c))
        )
        :effect (and
            (forall
                    (?l - location)
                    (and
                        (not (at-location ?r ?l))
                    )
                )
            (forall
                (?l - location)
                (and
                    (not (item-in ?i ?l))
                )
            )
            (forall
                (?re - receptacle)
                (and
                    (not (item-on ?i ?re))
                )
            )
            (item-in ?i ?c)
            (at-location ?r ?c)
            (is-occupied ?c)
        )
    )

    ; currently doesn't bring bread to kitchen counter
    ; can add coffee to precond to make it even harder
    (:action make-breakfast
        :parameters (?k - CounterTop ?r - robot ?b - Bread)
        :precondition (and
            (is-cooked ?b)
            (item-on ?b ?k)
            (at-location ?r ?k)
        )
        :effect (breakfast ?r)
    )

    (:action toast-bread-sliced
        :parameters (?r - robot ?b - Bread ?t - Toaster)
        :precondition (and
            (at-location ?r ?t)
            (item-in ?b ?t)
            (is-sliced ?b)
            (is-on ?t)
        )
        :effect (is-cooked ?b)
    )

    (:action turn-on
        :parameters (?r - robot ?t - toggleable)
        :precondition (and
            (at-location ?r ?t)
            (not (is-on ?t))
        )
        :effect (is-on ?t)
    )

    (:action clean-in-sink
        :parameters (?r - robot ?s - sink ?d - dirtyable ?ds - DishSponge ?f - Faucet)
        :precondition (and
            (at-location ?r ?s)
            (item-on ?ds ?s)
            (item-on ?d ?s)
            (is-on ?f)
            (not (is-clean ?d))
        )
        :effect (is-clean ?d)
    )

    (:action make-coffee
        :parameters (?r - robot ?c - CoffeeMachine ?m - Mug)
        :precondition (and
            (at-location ?r ?c)
            (item-in ?m ?c)
            (not (coffee-made ?c))
            (is-clean ?m)
            (not (is-full ?m))
            (is-on ?c)
        )
        :effect (coffee-made ?c)
    )


    (:action empty-liquid
        :parameters (?r - robot ?i - pourable ?s - sink)
        :precondition (and
        (at-location ?r ?s)
        (item-on ?i ?s)
        (is-full ?i)
        )
        :effect (not (is-full ?i))
    )

    ; general slicing
    (:action slice
        :parameters (?r - robot ?s - sliceable ?t - CounterTop ?k - Knife)
        :precondition (and
            (at-location ?r ?t)
            (item-on ?s ?t)
            (item-on ?k ?t)
            (not (is-sliced ?s))
        )
        :effect (is-sliced ?s)
    )

    ; add precondition so only one thing cooked at a time?
    (:action cook-potato
        :parameters (?r - robot ?po - Potato ?s - StoveBurner)
        :precondition (and
            (at-location ?r ?s)
            (item-on ?po ?s)
            (is-sliced ?po)
            (is-on ?s)
        )
        :effect (is-cooked ?po)
    )

    (:action crack-egg
        :parameters (?r - robot ?e - Egg ?s - StoveBurner)
        :precondition (and
            (at-location ?r ?s)
            (item-on ?e ?s)
            (not (is-cracked ?e))
        )
        :effect (is-cracked ?e)
    )

    (:action cook-egg
        :parameters (?r - robot ?e - Egg ?s - StoveBurner)
        :precondition (and
            (at-location ?r ?s)
            (item-on ?e ?s)
            (is-cracked ?e)
            (is-on ?s)
            (not (is-cooked ?e))
        )
        :effect (is-cooked ?e)
    )

    (:action omelet-at-counter
        :parameters (?r - robot ?e - Egg ?k - CounterTop ?po - Potato ?b - bread)
        :precondition (and
            (at-location ?r ?k)
            (item-on ?e ?k)
            (item-on ?po ?k)
            (item-on ?b ?k)
            (is-cracked ?e)
            (is-cooked ?e)
            (is-sliced ?po)
            (is-cooked ?po)
            (is-sliced ?b)
            (is-cooked ?b)
            (not (omelet-made ?r))

        )
        :effect (omelet-made ?r)
    )
)

; problem
(define (problem test)
    (:domain robo-home)
    
    (:objects
        robot1 - Robot
        counter - CounterTop
        sink - Sink
        sponge - DishSponge
        toaster - Toaster
        coffeeMachine - CoffeeMachine
        stoveBurner - StoveBurner
        cabinet - Cabinet
        drawer - Drawer
        shelf - Shelf
        fridge - Fridge
        bread - Bread
        potato - Potato
        egg - Egg
        mug - Mug
        ; plate - Plate
        knife - Knife
        faucet - Faucet
    )
    
    (:init
        (at-location robot1 counter)
        (item-in bread cabinet)
        (item-in potato fridge)
        (item-in egg fridge)
        (item-on mug shelf)
        (item-on knife sink)
        (item-in sponge drawer)
        (not (is-clean mug))
        (is-full mug)
        (not (is-open fridge))
        (not (is-open cabinet))
        (not (is-open drawer))
        (not (is-on toaster))
        (not (is-on coffeeMachine))
        (not (is-on stoveBurner))
    )
    
    (:goal
        (and
            ; (breakfast robot1)
            (coffee-made coffeeMachine)
            (omelet-made robot1)
        )
    )
)

; plan
1. (pick-n-place-on-receptacle robot1 knife counter)
   deleted: (item-on knife sink)
   added: (item-on knife counter)
   goals met: 0 of 2
2. (pick-n-place-on-receptacle robot1 mug sink)
   deleted: (at-location robot1 counter) (item-on mug shelf)
   added: (item-on mug sink) (at-location robot1 sink)
   goals met: 0 of 2
3. (empty-liquid robot1 mug sink)
   deleted: (is-full mug)
   goals met: 0 of 2
4. (move robot1 cabinet)
   deleted: (at-location robot1 sink)
   added: (at-location robot1 cabinet)
   goals met: 0 of 2
5. (open-openable robot1 cabinet)
   added: (is-open cabinet)
   goals met: 0 of 2
6. (pick-n-place-on-receptacle robot1 bread counter)
   deleted: (at-location robot1 cabinet) (item-in bread cabinet)
   added: (item-on bread counter) (at-location robot1 counter)
   goals met: 0 of 2
7. (slice robot1 bread counter knife)
   added: (is-sliced bread)
   goals met: 0 of 2
8. (pick-n-place-in-container robot1 bread toaster)
   deleted: (at-location robot1 counter) (item-on bread counter)
   added: (item-in bread toaster) (at-location robot1 toaster) (is-occupied toaster)
   goals met: 0 of 2
9. (turn-on robot1 toaster)
   added: (is-on toaster)
   goals met: 0 of 2
10. (toast-bread-sliced robot1 bread toaster)
   added: (is-cooked bread)
   goals met: 0 of 2
11. (pick-n-place-on-receptacle robot1 bread counter)
   deleted: (at-location robot1 toaster) (item-in bread toaster)
   added: (item-on bread counter) (at-location robot1 counter)
   goals met: 0 of 2
12. (move robot1 drawer)
   deleted: (at-location robot1 counter)
   added: (at-location robot1 drawer)
   goals met: 0 of 2
13. (open-openable robot1 drawer)
   added: (is-open drawer)
   goals met: 0 of 2
14. (pick-n-place-on-receptacle robot1 sponge sink)
   deleted: (at-location robot1 drawer) (item-in sponge drawer)
   added: (item-on sponge sink) (at-location robot1 sink)
   goals met: 0 of 2
15. (move robot1 faucet)
   deleted: (at-location robot1 sink)
   added: (at-location robot1 faucet)
   goals met: 0 of 2
16. (turn-on robot1 faucet)
   added: (is-on faucet)
   goals met: 0 of 2
17. (move robot1 fridge)
   deleted: (at-location robot1 faucet)
   added: (at-location robot1 fridge)
   goals met: 0 of 2
18. (open-openable robot1 fridge)
   added: (is-open fridge)
   goals met: 0 of 2
19. (pick-n-place-on-receptacle robot1 egg stoveburner)
   deleted: (at-location robot1 fridge) (item-in egg fridge)
   added: (item-on egg stoveburner) (at-location robot1 stoveburner)
   goals met: 0 of 2
20. (crack-egg robot1 egg stoveburner)
   added: (is-cracked egg)
   goals met: 0 of 2
21. (turn-on robot1 stoveburner)
   added: (is-on stoveburner)
   goals met: 0 of 2
22. (cook-egg robot1 egg stoveburner)
   added: (is-cooked egg)
   goals met: 0 of 2
23. (pick-n-place-on-receptacle robot1 egg counter)
   deleted: (at-location robot1 stoveburner) (item-on egg stoveburner)
   added: (item-on egg counter) (at-location robot1 counter)
   goals met: 0 of 2
24. (pick-n-place-on-receptacle robot1 potato counter)
   deleted: (item-in potato fridge)
   added: (item-on potato counter)
   goals met: 0 of 2
25. (slice robot1 potato counter knife)
   added: (is-sliced potato)
   goals met: 0 of 2
26. (pick-n-place-on-receptacle robot1 knife sink)
   deleted: (at-location robot1 counter) (item-on knife counter)
   added: (item-on knife sink) (at-location robot1 sink)
   goals met: 0 of 2
27. (clean-in-sink robot1 sink mug sponge faucet)
   added: (is-clean mug)
   goals met: 0 of 2
28. (pick-n-place-in-container robot1 mug coffeemachine)
   deleted: (at-location robot1 sink) (item-on mug sink)
   added: (item-in mug coffeemachine) (at-location robot1 coffeemachine) (is-occupied coffeemachine)
   goals met: 0 of 2
29. (turn-on robot1 coffeemachine)
   added: (is-on coffeemachine)
   goals met: 0 of 2
30. (make-coffee robot1 coffeemachine mug)
   added: (coffee-made coffeemachine)
   goals met: 1 of 2
31. (pick-n-place-on-receptacle robot1 potato stoveburner)
   deleted: (at-location robot1 coffeemachine) (item-on potato counter)
   added: (item-on potato stoveburner) (at-location robot1 stoveburner)
   goals met: 1 of 2
32. (cook-potato robot1 potato stoveburner)
   added: (is-cooked potato)
   goals met: 1 of 2
33. (pick-n-place-on-receptacle robot1 potato counter)
   deleted: (at-location robot1 stoveburner) (item-on potato stoveburner)
   added: (item-on potato counter) (at-location robot1 counter)
   goals met: 1 of 2
34. (omelet-at-counter robot1 egg counter potato bread)
   added: (omelet-made robot1)
   goals met: 2 of 2
